app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"
---
  def index
    @albums = Album.all.sort_by{|a| a.release_year ? a.release_year : 0 }